README.md

# Table of Contents

1.  [Prosody Distribution](#org49300f0)
    1.  [1.preprocessing.py:](#org81ec9d8)
    2.  [2. bigram.py:](#orgc33eb6f)
    3.  [3. LSTM.ipynb:](#orge3a8f88)
    4.  [4. BERT.ipynb:](#orgf2814b9)


<a id="org49300f0"></a>

# Prosody Distribution

This git repository contains four modules.


<a id="org81ec9d8"></a>

## 1.preprocessing.py:

Data preprocessing to collect tone and word from boston radio speech corpus.


<a id="orgc33eb6f"></a>

## 2. bigram.py:

A naive probabilistic model that prints out the conditional probability of tone symbol.


<a id="orge3a8f88"></a>

## 3. LSTM.ipynb:

Prosody detection and generation using pytorch LSTM.


<a id="orgf2814b9"></a>

## 4. BERT.ipynb:

Prosody detection and generation using BERT-NER(<https://github.com/huggingface/transformers/tree/master/examples#named-entity-recognition>)

Contact me at heehcs@gmail.com if you have any question or comment.

